[
  {
    "name": "AI for Health",
    "techs": [
      "PySpark",
      "Generative AI",
      "Large Language Models",
      "Graph Neural Networks",
      "Distributed Processing"
    ],
    "description": "Research under Prof. Fusheng Wang as part of my masters. Our main aim is to leverage advance AI techniques to solve the healthcare problems our university. Streamlined 6TB of medical data pipelines with PySpark for distributed processing, decreased processing time by 24%. Implemented a Generative AI model using LLaMA 2(Large Language Model Meta AI) and Bi-Attention GNN to predict patient care outcomes, boosted AUROC by 4.2% for readmission, F1-score by 8.4% for drug recommendation.",
    "github": "",
    "website": "https://www3.cs.stonybrook.edu/~fuswang/research.html",
    "imgSrc": "/images/Research.png",
    "type": "Featured Project"
  },
  {
    "name": "Predicting Flight Delays",
    "techs": [
      "Python",
      "PySpark",
      "LSTM",
      "XGBoost",
      "Selenium"
    ],
    "description": "Combined diverse data sources like weather patterns, air traffic, and historical flight data using Python and performed exploratory data analysis to evaluate causes of flight delays across the US. Built predictive models for flight delays utilising LSTM and XGBoost and achieved a R2-squared coefficient of 0.98. Data is web scraped automatically by leveraging Selenium.",
    "github": "https://github.com/nitin-sontineni/Predicting-Flight-Delays",
    "website": "",
    "imgSrc": "/images/Flight_Delays.png",
    "type": "Featured Project"
  },
  {
    "name": "Dashboard for Visualizing US Tech Layoffs",
    "techs": [
      "Python",
      "React",
      "D3.js",
      "Django",
      "Selenium"
    ],
    "description": "Developed a interactive dashboard for visualizing layoff trends across US. Implemented dynamic user interactions like time-range selection, sector filtering, geographical location selection.",
    "github": "https://github.com/ManemDhanush/visualizing-us-tech-layoffs",
    "website": "",
    "imgSrc": "/images/Visualization_Poster.jpg",
    "type": "Featured Project"
  },
  {
    "name": "CourseHub",
    "techs": [
      "React",
      "Node",
      "Express",
      "Mongo DB",
      "Full Stack Development"
    ],
    "description": "Built a course management system using MERN Stack, enhanced collaboration between 12 instructors and 500+ students.",
    "github": "https://github.com/nitin-sontineni/CourseHub",
    "website": "",
    "imgSrc": "/images/Course_Hub.png",
    "type": "Featured Project"
  },
  {
    "name": "Firearm Detection",
    "techs": [
      "AWS",
      "MongoDB",
      "Docker",
      "Terraform",
      "Helm",
      "Kubernetes",
      "Kafka",
      "Zookeeper"
    ],
    "description": "I developed a real-time object detection model in C++ and linked it with ONNX runtime, which slashed the inference time by 80% for pipeline operations. Additionally, I constructed a Kafka pipeline on AWS EKS to manage continuous frame streams, thereby optimizing the process of routing model inferences to an S3 bucket and MongoDB database for subsequent analysis and retrieval.",
    "github": "",
    "website": "",
    "imgSrc": "https://opengraph.githubassets.com/1afeafda/Shikhar97/FirearmDetection",
    "type": "Side Project"
  },
  {
    "name": "Spatial Analysis and Hot Spot Identification",
    "techs": [
      "Python",
      "Scala",
      "Spark",
      "Docker",
      "Git"
    ],
    "description": "I employed SparkSQL to perform spatial queries, including range and distance join operations, on the NYC Taxi Trip dataset, facilitating the efficient processing of large, unstructured data. Furthermore, I devised user-defined functions in SparkSQL to extract crucial operational and strategic data, which proved instrumental in daily decision-making. Lastly, I undertook a spatial hot spot analysis using Scala and Apache Spark, uncovering statistically significant insights.",
    "github": "https://github.com/Shikhar97/Spatial-Hotspot-Analysis",
    "website": "",
    "imgSrc": "https://opengraph.githubassets.com/1afeafda/Shikhar97/Spatial-Hotspot-Analysis",
    "type": "Side Project"
  },
  {
    "name": "Innovative Visualizations using D3",
    "techs": [
      "D3.js",
      "HTML",
      "CSS",
      "Bootstrap",
      "JavaScript",
      "React.js"
    ],
    "description": "The project goes beyond common chart types and presents the data in a creative manner, making it interesting and informative for a general audience. The visualization is designed for museum visitors and effectively communicates information about the exoplanets discovered by NASA missions.",
    "github": "https://github.com/Shikhar97/D3-Innovative-Visualization",
    "website": "",
    "imgSrc": "https://opengraph.githubassets.com/1afeafda/Shikhar97/D3-Innovative-Visualization",
    "type": "Side Project"
  },
  {
    "name": "Google-Dino using CNN",
    "techs": [
      "Python",
      "NumPy",
      "Pandas",
      "PyTorch",
      "OpenCV"
    ],
    "description": "I crafted and trained Google-Dino, leveraging Convolutional Neural Networks (CNN) to excel in the Google Chrome Dinosaur game. The model adeptly assesses the game screen, making astute decisions and consistently achieving high scores. This project underscores the application of machine learning in gaming and the prowess of CNNs in real-time decision-making tasks.",
    "github": "https://github.com/Shikhar97/Google-dragon",
    "website": "",
    "imgSrc": "https://opengraph.githubassets.com/1afeafda/Shikhar97/Google-dragon",
    "type": "Side Project"
  },
  {
    "name": "InstaClone",
    "techs": [
      "Python",
      "Flask",
      "HTML",
      "CSS",
      "JavaScript",
      "Bootstrap"
    ],
    "description": "A web application that emulates the core features of Instagram, such as posting and sharing photos, following other users, and liking posts, is developed using Flask.This application allows users to create accounts, upload photos, and interact with other users in a manner similar to Instagram. While the full suite of features may not be replicated, the fundamental aspects are implemented, providing a platform for users to engage in photo sharing and social networking. ",
    "github": "https://github.com/Shikhar97/Mini-Instagram",
    "website": "",
    "imgSrc": "https://opengraph.githubassets.com/1afeafda/Shikhar97/Mini-Instagram",
    "type": "Side Project"
  }
]